bombardier_results/run0_082023/arch_512
Bombarding http://localhost:3000 for 10s using 512 connection(s)
[================================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     42432.35   29197.72  176466.91
  Latency       14.04ms    34.32ms   608.53ms
  Latency Distribution
     50%    11.17ms
     75%    16.25ms
     90%    22.06ms
     95%    27.17ms
     99%    70.41ms
  HTTP codes:
    1xx - 0, 2xx - 80619, 3xx - 0, 4xx - 0, 5xx - 0
    others - 283956
  Errors:
    dial tcp [::1]:3000: connect: connection refused - 283956
  Throughput:     1.92MB/s