bombardier_results/run0_082023/cgi_512
Bombarding http://localhost:3000 for 10s using 512 connection(s)
[================================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     69557.98    6289.59   85214.14
  Latency       12.17ms   448.51ms     23.56s
  Latency Distribution
     50%   340.00us
     75%   664.00us
     90%     1.30ms
     95%     1.95ms
     99%     4.05ms
  HTTP codes:
    1xx - 0, 2xx - 697126, 3xx - 0, 4xx - 0, 5xx - 0
    others - 47
  Errors:
       timeout - 25
    the server closed connection before returning the first response byte. Make sure the server returns 'Connection: close' response header before closing the connection - 22
  Throughput:     6.78MB/s