bombardier_results/run0_082023/cgi_64
Bombarding http://localhost:3000 for 10s using 64 connection(s)
[================================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     68535.05    4209.65   79344.72
  Latency        0.93ms    57.00ms     10.01s
  Latency Distribution
     50%   354.00us
     75%   683.00us
     90%     1.30ms
     95%     1.93ms
     99%     3.98ms
  HTTP codes:
    1xx - 0, 2xx - 685802, 3xx - 0, 4xx - 0, 5xx - 0
    others - 20
  Errors:
       timeout - 20
  Throughput:    15.68MB/s