bombardier_results/run0_082023/handy_512
Bombarding http://localhost:3000 for 10s using 512 connection(s)
[================================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      7197.11    1762.08   13863.90
  Latency       71.36ms    60.93ms   603.12ms
  Latency Distribution
     50%    52.53ms
     75%    99.38ms
     90%   124.08ms
     95%   176.24ms
     99%   333.95ms
  HTTP codes:
    1xx - 0, 2xx - 59701, 3xx - 0, 4xx - 0, 5xx - 0
    others - 12177
  Errors:
    the server closed connection before returning the first response byte. Make sure the server returns 'Connection: close' response header before closing the connection - 12154
    dial tcp [::1]:3000: connect: connection refused - 16
    write tcp 127.0.0.1:61686->127.0.0.1:3000: write: broken pipe - 1
    write tcp 127.0.0.1:49721->127.0.0.1:3000: write: broken pipe - 1
    write tcp 127.0.0.1:49592->127.0.0.1:3000: write: broken pipe - 1
    write tcp 127.0.0.1:49299->127.0.0.1:3000: write: broken pipe - 1
    write tcp 127.0.0.1:65535->127.0.0.1:3000: write: broken pipe - 1
    write tcp 127.0.0.1:49591->127.0.0.1:3000: write: broken pipe - 1
    write tcp 127.0.0.1:49665->127.0.0.1:3000: write: broken pipe - 1
  Throughput:     1.74MB/s