bombardier_results/run0_082023/handy_64
Bombarding http://localhost:3000 for 10s using 64 connection(s)
[================================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     17457.81    2832.99   22854.05
  Latency        4.31ms   168.35ms     31.41s
  Latency Distribution
     50%     2.45ms
     75%     3.06ms
     90%     3.38ms
     95%     3.64ms
     99%     4.47ms
  HTTP codes:
    1xx - 0, 2xx - 172514, 3xx - 0, 4xx - 0, 5xx - 0
    others - 8
  Errors:
    the server closed connection before returning the first response byte. Make sure the server returns 'Connection: close' response header before closing the connection - 4
    dial tcp [::1]:3000: connect: connection refused - 4
  Throughput:     0.91MB/s