bombardier_results/run0_082023/serverino_64
Bombarding http://localhost:3000 for 10s using 64 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     84089.90   10556.41   89928.83
  Latency      760.09us    51.54ms      9.97s
  Latency Distribution
     50%   202.00us
     75%   253.00us
     90%   331.00us
     95%   421.00us
     99%     2.03ms
  HTTP codes:
    1xx - 0, 2xx - 840864, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    14.60MB/s